{
  "roles": [
    "UX Design",
    "Ideation",
    "Prototyping",
    "Pitching"
  ],
  "title": "5G Innovation",
  "client": "NFL + Verizon",
  "description": "NFL Game Sense is an in-stadium video experience that allows fans to follow the game from multiple camera angles as well as real time data overlays that help tell the story of the game.",
  "overview": "\"How does 5G technology fit within the context of the Super Bowl? We want a lot of videos, how fast can you figure it out?\"\n\n\n\nVerizon had partnered with the NFL to showcase the capabilities of 5G and it was the design team's job to craft a solution that highlighted the technology while taking into account what a person at the Super Bowl is actually doing (read: we didn't want it to be cool but useless).",
  "thumbnail": "/img/5g-thumbnail.png",
  "details": "# Process\n\nWe had about two weeks to fully flesh out a solution to pitch to Verizon, so after a healthy amount of contemplating If I Am Cut Out For This Life™, it was time to get started\n\n\n\nThe team consisted of myself as lead user experience designer, Armond as lead product designer, Debbie as motion graphics artist, and Ariana as user experience intern. The general starting point presented to us was somehow utilizing the capability of multiple video feeds into a robust user experience.\n\n\n\n# Research\n\nWe didn't just want to throw up a bunch of random videos at once and call it a day, so we took a step back to see what would actually be interesting to someone who has at the Super Bowl. We didn't have the time or resources to for a fresh research phase so we had to improvise. Luckily I had been at the NFL for quite some time when we received this project so I had a fairly comprehensive understanding of our previous research.\n\n\n\nWe had a tremendous amount of past research both that I had personally conducted or have looked through when I was first on boarded. Through usability tests, field research, focus groups, among other things, we had a fairly accurate pulse on the football fan. What we then had to do was frame this knowledge and understanding to our problem space.\n\n\n\n\n\n![NFL User Journey User Experience Research Model](/img/nfl_5ginnovation_nflgamesense_v3.pptx.png)\n\n\n\n\n\nOne output of this was a journey map for a previous Super Bowl game. We chose the one that the Eagles were in for some reason (Ariana was and still is, an Eagles die-hard). The journey map allowed us to identify gaps within the live in-stadium experience that hopefully uncover opportunities for us to provide something meaningful.\n\n\n\n\n\nA major gap we identified was when a special play called \"The Philly Special\" occurred. It had happened so fast and it was a play with movements so unusual that it was difficult to understand what happened even on the TV with announcers let alone in the stadium.\n\n```html\n<iframe width=\"752\" height=\"528\" src=\"https://www.youtube.com/embed/stE074a8QJs\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe>\n```\n\n## This was the gap we were looking for, a moment where we could imagine someone actually using their phone to look at something that's not social media while at the stadium, not some wild and convoluted scenario to force our idea.\n\n# Ideation\n\nDue to the time constraints, we jumped right into ideating when we found our opportunity. We came up with and erased more ideas, screen configurations, and features than I can count. We sat in a room with a whiteboard for about half a day, trying to figure out what exactly we wanted to do.\n\n`<div class=\"triple\">`\n\n![](/img/whiteboard1.jpg)\n\n\n\n![](/img/whiteboard2.jpg)\n\n\n\n![](/img/whiteboard3.jpg)\n\n`</div>`\n\n## Eventually, we boiled it down to a few key user needs:\n\n## 1. I want to be able to clearly and quickly see what just happened.\n\n## 2. I want to know why a moment was important and exciting.\n\n## 3. I want to be able to easily jump to a key moment. \n\nFrom these needs, we knew more or less what kind of experience we wanted to provide. We wanted  angles of the same play to negate the bad viewing angle of sitting in a stadium. We wanted stats and overlays to provide the analysis and emphasis that a television viewer would get. We wanted a to easily scan for big moments to take advantage of the lulls in the game in addition to being able to quickly identify and watch a big play that just happened. <br/><br/>\nMore and more we began to see what this thing we were working for was going to be. However it seemed that the more clear things got, the less time we had. We had to be more strategic with our time for the second half of this project. We not only had to flesh out our idea but also a pitch to Verizon.\n\n![NFL Story Board](/img/storyboard.png)\n\nAriana and I would create and refine other UX artifacts that would not only provide us a foundation for design but also a mechanism to tell a story.  A fun example being this storyboard I created to provide us context both in the design process and during the pitch.\n\n\n\nArmond and I were co-designing the interface, with my wireframes being either whiteboard drawings or simply me describing things to him.\n\n\n\nWe also needed to prepare a prototype, which is where Debbie comes in. While Armond and I were designing the interface we were also sourcing multiple videos of the Philly Special play, time stamping and describing where we wanted the frames to go to Debbie.\n\n\n\nWe were doing concurrently while handling other projects within the NFL, so it was hectic to say the least.\n\n\n\n\n\n# Solution\n\n\n![](/img/multiple-angles.png \"Watch the Game Live from Multiple Angles\")\n\n![](/img/best-angles.png)\n\n</th>\n  </tr>\n\n</table>\n\n<h2>See Insights, Stats, and Predictions to help you follow and understand all the big moments.</h2>\n\n<h3>Live Stats Experience</h3>\n<table>\n  <tr>\n    <th>\n\n![](/img/livestats2.png \"Watch the Game Live from Multiple Angles\")\n\n</th>\n    <th>\n\n![](/img/livestats3.png)\n\n</th>\n\n<th>\n\n![](/img/livestats1.png)\n\n</th>\n  </tr>\n\n</table>",
  "galleryImages": [
    "/img/nfl5goptimized.gif"
  ]
}